EA/src/InformationRegisters/СтатусыСборкиЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>СтатусыСборкиЗаказов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыОбработкиЗаказа</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выгружено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОснованиеУстановкиСтатуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОснованияУстановкиСтатусаДокумента</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

EA/src/InformationRegisters/СтатусыАктуальностиЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>СтатусыАктуальностиЗаказов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отменен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусАктуальности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыАктуальностиЗаказов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выгружено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОснованиеУстановкиСтатуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОснованияУстановкиСтатусаДокумента</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

EA/src/CommonModules/СтатусыДокументов/Ext/Module.bsl
Функция УстановитьСтатусСборкиЗаказа(Документ,ОснованиеУстановкиСтатуса,Статус,Сотрудник=Неопределено,Период = неопределено,НеВыгружатьВ77 = Ложь) Экспорт
	
	ТекстИсключения = "";
	Если Сотрудник = Неопределено тогда
		Сотрудник = справочники.Сотрудники.ПустаяСсылка();		
	КонецЕсли;
	
	Если Период = неопределено тогда
		Период = ТекущаяДата();
	ИначеЕсли ТипЗнч(Период) <> Тип("Дата") тогда
		ТекстИсключения = "Некорректно заполнен период!";
	КонецЕсли;
	
	Если ТипЗнч(Документ) <> Тип("ДокументСсылка.Заказ") или Документ = ПредопределенноеЗначение("Документ.Заказ.ПустаяСсылка") тогда
		ТекстИсключения = ТекстИсключения + ?(ЗначениеЗаполнено(ТекстИсключения),Символы.ПС,"") + "Некорректно указан заказ!";	
	КонецЕсли;
	
	Если ТипЗнч(Сотрудник) <> Тип("СправочникСсылка.Сотрудники") тогда
		ТекстИсключения = ТекстИсключения + ?(ЗначениеЗаполнено(ТекстИсключения),Символы.ПС,"") + "Некорректно указан сотрудник!";	
	КонецЕсли;
	
	Если ТипЗнч(Статус) <> Тип("СправочникСсылка.СтатусыОбработкиЗаказа") тогда
		ТекстИсключения = ТекстИсключения + ?(ЗначениеЗаполнено(ТекстИсключения),Символы.ПС,"") + "Некорректно указан статус!";	
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(ТекстИсключения) тогда
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатусыСборкиЗаказов.Период,
	|	СтатусыСборкиЗаказов.Документ,
	|	СтатусыСборкиЗаказов.ОснованиеУстановкиСтатуса,
	|	СтатусыСборкиЗаказов.Сотрудник,
	|	СтатусыСборкиЗаказов.Статус
	|ИЗ
	|	РегистрСведений.СтатусыСборкиЗаказов КАК СтатусыСборкиЗаказов
	|ГДЕ
	|	ЕСТЬNULL(СтатусыСборкиЗаказов.Статус.ПорядокВАптеках, 0) >= &ПорядокУстанавливаемогоСтатуса
	|	И СтатусыСборкиЗаказов.Документ = &Документ";
	
	Запрос.УстановитьПараметр("ПорядокУстанавливаемогоСтатуса",Статус.ПорядокВАптеках);
	Запрос.УстановитьПараметр("Документ",Документ);
	Запрос.УстановитьПараметр("ОснованиеУстановкиСтатуса",ОснованиеУстановкиСтатуса);
	Результат = Запрос.Выполнить();
	Если не Результат.Пустой() тогда
		Возврат Ложь;		
	КонецЕсли;
		
	МенеджерЗаписи = РегистрыСведений.СтатусыСборкиЗаказов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = Период;
	МенеджерЗаписи.Документ = Документ;
	МенеджерЗаписи.ОснованиеУстановкиСтатуса = ОснованиеУстановкиСтатуса;
	МенеджерЗаписи.Сотрудник = Сотрудник;
	МенеджерЗаписи.Статус = Статус;
	МенеджерЗаписи.Выгружено = НеВыгружатьВ77;
	МенеджерЗаписи.Записать();
	
	Возврат Истина;
		
КонецФункции

Функция УстановитьСтатусАктуальностиЗаказа(Документ,ОснованиеУстановкиСтатуса,СтатусАктуальности,Сотрудник=Неопределено,Период = неопределено,НеВыгружатьВ77 = Ложь) Экспорт
	
		
	ТекстИсключения = "";
	Если Сотрудник = Неопределено тогда
		Сотрудник = справочники.Сотрудники.ПустаяСсылка();		
	КонецЕсли;
	
	Если Период = неопределено тогда
		Период = ТекущаяДата();
	ИначеЕсли ТипЗнч(Период) <> Тип("Дата") тогда
		ТекстИсключения = "Некорректно заполнен период!";
	КонецЕсли;
	
	Если ТипЗнч(Документ) <> Тип("ДокументСсылка.Заказ") или Документ = ПредопределенноеЗначение("Документ.Заказ.ПустаяСсылка") тогда
		ТекстИсключения = ТекстИсключения + ?(ЗначениеЗаполнено(ТекстИсключения),Символы.ПС,"") + "Некорректно указан заказ!";	
	КонецЕсли;
	
	Если ТипЗнч(Сотрудник) <> Тип("СправочникСсылка.Сотрудники") тогда
		ТекстИсключения = ТекстИсключения + ?(ЗначениеЗаполнено(ТекстИсключения),Символы.ПС,"") + "Некорректно указан сотрудник!";	
	КонецЕсли;
	
	Если ТипЗнч(СтатусАктуальности) <> Тип("СправочникСсылка.СтатусыАктуальностиЗаказов") или не ЗначениеЗаполнено(СтатусАктуальности) тогда
		ТекстИсключения = ТекстИсключения + ?(ЗначениеЗаполнено(ТекстИсключения),Символы.ПС,"") + "Некорректно указан статус актуальности!";	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстИсключения) тогда
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатусыАктуальностиЗаказов.Период,
	|	СтатусыАктуальностиЗаказов.Документ,
	|	СтатусыАктуальностиЗаказов.ОснованиеУстановкиСтатуса,
	|	СтатусыАктуальностиЗаказов.СтатусАктуальности,
	|	СтатусыАктуальностиЗаказов.Сотрудник
	|ИЗ
	|	РегистрСведений.СтатусыАктуальностиЗаказов КАК СтатусыАктуальностиЗаказов
	|ГДЕ
	|	СтатусыАктуальностиЗаказов.Документ = &Документ
	|	И СтатусыАктуальностиЗаказов.ОснованиеУстановкиСтатуса = &ОснованиеУстановкиСтатуса
	|	И СтатусыАктуальностиЗаказов.СтатусАктуальности = &СтатусАктуальности";
	
	Запрос.УстановитьПараметр("СтатусАктуальности",СтатусАктуальности);
	Запрос.УстановитьПараметр("Документ",Документ);
	Запрос.УстановитьПараметр("ОснованиеУстановкиСтатуса",ОснованиеУстановкиСтатуса);
	Результат = Запрос.Выполнить();
	Если не Результат.Пустой() тогда
		Возврат Ложь;		
	КонецЕсли;
		
	МенеджерЗаписи = РегистрыСведений.СтатусыАктуальностиЗаказов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = Период;
	МенеджерЗаписи.Документ = Документ;
	МенеджерЗаписи.ОснованиеУстановкиСтатуса = ОснованиеУстановкиСтатуса;
	МенеджерЗаписи.Сотрудник = Сотрудник;
	МенеджерЗаписи.СтатусАктуальности = СтатусАктуальности;
	МенеджерЗаписи.Выгружено = НеВыгружатьВ77;
	МенеджерЗаписи.Записать();
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьСтатусСборкиЗаказа(Документ,Период = неопределено) Экспорт
	
	Если не ЗначениеЗаполнено(Период) тогда
		Период = ТекущаяДата();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтатусыСборкиЗаказовСрезПоследних.Статус
	|ИЗ
	|	РегистрСведений.СтатусыСборкиЗаказов.СрезПоследних(&Период, Документ = &Документ) КАК СтатусыСборкиЗаказовСрезПоследних";
	Запрос.УстановитьПараметр("Период",Период);
	Запрос.УстановитьПараметр("Документ", Документ);
	
	Результат = Запрос.Выполнить();
	
	Если не Результат.Пустой() тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() цикл
			Возврат Выборка.Статус;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Справочники.СтатусыОбработкиЗаказа.ПустаяСсылка();			
	
КонецФункции

Функция ПолучитьСтатусАктуальностиЗаказа(Документ,Период = Неопределено) Экспорт
	
	Если не ЗначениеЗаполнено(Период) тогда
		Период = ТекущаяДата();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтатусыАктуальностиЗаказовСрезПоследних.СтатусАктуальности КАК СтатусАктуальности
	|ИЗ
	|	РегистрСведений.СтатусыАктуальностиЗаказов.СрезПоследних(&Период, Документ = &Документ) КАК СтатусыАктуальностиЗаказовСрезПоследних";
	Запрос.УстановитьПараметр("Период",Период);
	Запрос.УстановитьПараметр("Документ", Документ);
	
	Результат = Запрос.Выполнить();
	
	Если не Результат.Пустой() тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() цикл
			Возврат Выборка.СтатусАктуальности;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Справочники.СтатусыАктуальностиЗаказов.ПустаяСсылка();	
	
	
КонецФункции
